#### Terraform Initialization ⚙️　`success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan Result</summary>

```terraform
nown after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "wordpress-bedrock-prod-wordpress-service"
      + platform_version                   = "LATEST"
      + region                             = "ap-northeast-1"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "wordpress-bedrock-prod-wordpress-service"
          + "Project"     = "wordpress-bedrock"
        }
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "wordpress-bedrock-prod-wordpress-service"
          + "Project"     = "wordpress-bedrock"
        }
      + task_definition                    = "arn:aws:ecs:ap-northeast-1:662478938633:task-definition/wordpress-bedrock-prod-wordpress:1"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + deployment_configuration (known after apply)

      + load_balancer {
          + container_name   = "wordpress"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:662478938633:targetgroup/wp-20260128135824911400000001/71adda25c89a4deb"
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0731157ea8a1cf809",
            ]
          + subnets          = [
              + "subnet-05210351e02b57c13",
              + "subnet-0a385f0ac8ba31fa0",
            ]
        }
    }

  # aws_s3_bucket_policy.media will be updated in-place
  ~ resource "aws_s3_bucket_policy" "media" {
        id     = "wordpress-media-20260128114110973600000001"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::662478938633:distribution/E3FAGMWM2NPZ8I"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::wordpress-media-20260128114110973600000001/*"
                      - Sid       = "AllowCloudFrontServicePrincipal"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 7 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + ecs_service_id                      = (known after apply)
  + ecs_service_name                    = "wordpress-bedrock-prod-wordpress-service"
  + phase9_summary                      = <<-EOT
        ========================================
        Phase 9: ECS Service - Complete
        ========================================
        
        ECS Service:
        - Name: wordpress-bedrock-prod-wordpress-service
        - Launch Type: Fargate
        - Desired Count: 2
        - Platform Version: LATEST
        
        Auto Scaling:
        - Min Capacity: 2
        - Max Capacity: 4
        - CPU Target: 70%
        - Memory Target: 80%
        
        Network:
        - Subnets: 2 private subnets
        - Security Group: sg-0731157ea8a1cf809
        - Public IP: Disabled
        
        Load Balancer:
        - Target Group: wp-20260128135824911400000001
        - Container Port: 80
        
        Deployment:
        - Circuit Breaker: Enabled with rollback
        - Maximum: 200%
        - Minimum Healthy: 100%
        
        CloudWatch Alarms:
        - CPU utilization > 85%
        - Memory utilization > 90%
        - Running task count < minimum
        
        WordPress URL: http://wordpress-bedrock-prod-alb-796184839.ap-northeast-1.elb.amazonaws.com
        
        Next Steps:
        - Phase 10: Create Route53 DNS and ACM Certificate
        - Phase 11: Create Lambda for image generation
        - Phase 12: Create API Gateway webhook
        
        ========================================
    EOT

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @takahiro1226, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform Plan`*